%五阶贝塞尔曲线
%为满足使连接点曲率连续和切线连续,增加了两对控制点
clc
clear
close all

%五阶控制点
p0=[0,0];
p1=[5,6];
p2=[10,8];

p3=[15,11];
p4=[20,14];
p5=[25,18];

%曲线参数t
t = 0:0.0001:1;

%第一条五阶贝塞尔曲线
first_5_bezier_x = p0(1).*(1-t).^5 + 5.*p1(1).*t.*(1-t).^4 + 10.*p2(1).*t.^2.*(1-t).^3 + 10.*p3(1).*t.^3.*(1-t).^2 + 5.*p4(1).*t.^4.*(1-t) + p5(1).*t.^5;
first_5_bezier_y = p0(2).*(1-t).^5 + 5.*p1(2).*t.*(1-t).^4 + 10.*p2(2).*t.^2.*(1-t).^3 + 10.*p3(2).*t.^3.*(1-t).^2 + 5.*p4(2).*t.^4.*(1-t) + p5(2).*t.^5;


g1 = p5(1) - p4(1);
g2 = p4(1) - p3(1);
h1 = p5(2) - p4(2);
h2 = p4(2) - p3(2);
m = 4*abs( g1*(h1-h2) - h1*(g1-g2) );
ss = 5*( ((g1*g1) + (h1*h1)).^1.5 );
c1 = m/ss;

%五阶控制点
r0 = [25,18];

r2 = [30,25];
r3 = [35,27];

%计算辅助控制点
g = (p5(1) - p4(1));
h = (p5(2) - p4(2));
r = (g*g + h*h).^1.5;
m1 = abs( g*(r2(2) - p5(2))  -  h*( r2(1) - p5(1)));
ss1 = 1.5*c1*r;
n = sqrt(m1/ss1);


r1 = [(n*g + r0(1)), (n*h + r0(2))];


%曲线参数t1
t1 = 0:0.0001:1;

%第二条五阶贝塞尔曲线
second_3_bezier_x = r0(1).*(1-t).^3 + 3.*r1(1).*t.*(1-t).^2 + 3.*r2(1).*t.^2.*(1-t) + r3(1).*t.^3;
second_3_bezier_y = r0(2).*(1-t).^3 + 3.*r1(2).*t.*(1-t).^2 + 3.*r2(2).*t.^2.*(1-t) + r3(2).*t.^3;


t = 0:0.0001:1;

dot_x_1 = 5*(p1(1) - p0(1)).*(1-t).^4 + 20*(p2(1) - p1(1)).*t.*(1-t).^3 + 30.*(p3(1) - p2(1)).*t.*t.*(1-t).*(1-t)  + 20.*(p4(1) - p3(1)).*t.*t.*t.*(1-t) + 5.*(p5(1) - p4(1)).*t.^4;
dot_y_1 = 5*(p1(2) - p0(2)).*(1-t).^4 + 20*(p2(2) - p1(2)).*t.*(1-t).^3 + 30.*(p3(2) - p2(2)).*t.*t.*(1-t).*(1-t)  + 20.*(p4(2) - p3(2)).*t.*t.*t.*(1-t) + 5.*(p5(2) - p4(2)).*t.^4;

dot_dot_x_1 = 20*(p2(1) - 2*p1(1) + p0(1)).*(1-t).^3 + 60.*(p3(1) - 2.*p2(1) + p1(1)).*t.*(1-t).*(1-t) + 60*(p4(1) - 2*p3(1) + p2(1)).*t.*t.*(1-t) + 20*(p5(1)-2*p4(1) + p3(1)).*(t).^3; 
dot_dot_y_1 = 20*(p2(2) - 2*p1(2) + p0(2)).*(1-t).^3 + 60.*(p3(2) - 2.*p2(2) + p1(2)).*t.*(1-t).*(1-t) + 60*(p4(2) - 2*p3(2) + p2(2)).*t.*t.*(1-t) + 20*(p5(2)-2*p4(2) + p3(2)).*(t).^3;



curvature1 = (dot_x_1.*dot_dot_y_1 - dot_dot_x_1.*dot_y_1) ./ (dot_y_1.*dot_y_1 + dot_x_1.*dot_x_1).^1.5;

dot_x_2 = 3*(r1(1) - r0(1)).*(1-t).^2 + 6.*(r2(1) - r1(1)).*t.*(1-t) + 30*(r3(1) - r2(1)).*t.*t;
dot_y_2 =  3*(r1(2) - r0(2)).*(1-t).^2 + 6.*(r2(2) - r1(2)).*t.*(1-t) + 30*(r3(2) - r2(2)).*t.*t;

dot_dot_x_2 = 6*(r2(1) - 2*r1(1) + r0(1)).*(1-t) + 6*(r3(1) - 2*r2(1) + r1(1)).*t ;
dot_dot_y_2 = 6*(r2(2) - 2*r1(2) + r0(2)).*(1-t) + 6*(r3(2) - 2*r2(2) + r1(2)).*t;

curvature2 = (dot_x_2.*dot_dot_y_2 - dot_dot_x_2.*dot_y_2) ./ (dot_y_2.*dot_y_2 + dot_x_2.*dot_x_2).^1.5;

curvature = [curvature1 curvature2];
x = [first_5_bezier_x second_3_bezier_x];

figure(1)
hold on
% grid
plot(first_5_bezier_x, first_5_bezier_y,"k-","LineWidth",2,"DisplayName","第一段五阶贝塞尔曲线")
plot([p0(1),p1(1),p2(1),p3(1),p4(1),p5(1)],[p0(2),p1(2),p2(2),p3(2),p4(2),p5(2)],'r.','MarkerSize',30, "DisplayName","第一段五阶贝塞尔曲线的控制点")
legend
xlabel("X(m)")
ylabel("Y(m)")
plot(second_3_bezier_x, second_3_bezier_y,"b-","LineWidth",2,"DisplayName","第二段三阶贝塞尔曲线")
plot([r0(1),r1(1),r2(1),r3(1)],[r0(2),r1(2),r2(2),r3(2)],'g.','MarkerSize',30,"DisplayName","第二段三阶贝塞尔曲线的控制点")

plot(r1(1) , r1(2),'.','MarkerSize',30,"DisplayName","第二段三阶贝塞尔曲线的辅助控制点" )



figure(2)

plot(x,curvature,"r-","LineWidth",2,"DisplayName","曲率");
legend

ylabel("curvature(m-1)")
xlabel("X(m)")

